app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]
---
  def create
    school_class = SchoolClass.create(school_class_params)

UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]
---
  def update
    school_class = current_school_class
    school_class.update(school_class_params)