app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-04-29 04:22:45.001738"], ["id", 1]]
---
  def update
    student = current_student
    student.update(student_params)